src/cf/InformationRegisters/СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СформированныеСообщенияСИзмененнымиНомерамиМПУНФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СформированныеСообщенияСИзмененнымиНомерамиМПУНФ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьНомерСообщения() Экспорт 
	
	НомерСообщенияОбмена = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.СформированныеСообщенияСИзмененнымиНомерамиМПУНФ КАК СформированныеСообщенияСИзмененнымиНомерамиМПУНФ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НомерСообщенияОбмена = ВыборкаДетальныеЗаписи.Номер + НомерСообщенияОбмена;
	КонецЕсли;
	
	Возврат НомерСообщенияОбмена;
	
КонецФункции

Функция ПолучитьСообщенияДляОтправки(КодУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.Номер КАК Номер,
		|	СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.Сообщение КАК Сообщение
		|ИЗ
		|	РегистрСведений.СформированныеСообщенияСИзмененнымиНомерамиМПУНФ КАК СформированныеСообщенияСИзмененнымиНомерамиМПУНФ
		|ГДЕ
		|	СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.КодУзла = &КодУзла";
	
	Запрос.УстановитьПараметр("КодУзла", КодУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивССообщениями = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивССообщениями.Добавить(Новый Структура("Номер, Сообщение", ВыборкаДетальныеЗаписи.Номер, ВыборкаДетальныеЗаписи.Сообщение));
	КонецЦикла;
	
	Возврат Новый Структура("МассивССообщениями", МассивССообщениями)
	
КонецФункции // ()

Процедура УдалитьСообщение(Номер, КодУзла) Экспорт
	
	НаборЗаписей = РегистрыСведений.СформированныеСообщенияСИзмененнымиНомерамиМПУНФ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номер.Установить(Номер);
	НаборЗаписей.Отбор.КодУзла.Установить(КодУзла);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
